Repository: fathialamre/jet
Catalog: packages/jet/lib/forms/localization/l10n/intl_*.arb
Languages: ar

# requiredErrorText
source: This field cannot be empty.
ar: هذا الحقل مطلوب.

# emailErrorText
source: This field requires a valid email address.
ar: هذا الحقل يتطلب عنوان بريد إلكتروني صالح.

# urlErrorText
source: This field requires a valid URL address.
ar: هذا الحقل يتطلب عنوان URL صالح.

# phoneErrorText
source: This field requires a valid phone number.
ar: هذا الحقل يتطلب رقم هاتف صالح.

# numericErrorText
source: Value must be numeric.
ar: يجب أن تكون القيمة رقمية.

# integerErrorText
source: This field requires a valid integer.
ar: هذا الحقل يتطلب عددًا صحيحًا صالحًا.

# creditCardErrorText
source: This field requires a valid credit card number.
ar: هذا الحقل يتطلب رقم بطاقة ائتمان صالح.

# dateStringErrorText
source: This field requires a valid date string.
ar: هذا الحقل يتطلب تاريخًا صالحًا.

# equalErrorText
source: This field value must be equal to {value}.
ar: يجب أن تكون قيمة هذا الحقل مساوية لـ {value}.

# notEqualErrorText
source: This field value must not be equal to {value}.
ar: يجب ألا تكون قيمة هذا الحقل مساوية لـ {value}.

# minLengthErrorText
source: Value must have a length greater than or equal to {minLength}.
ar: يجب أن يكون الطول أكبر من أو يساوي {minLength}.

# maxLengthErrorText
source: Value must have a length less than or equal to {maxLength}.
ar: يجب أن يكون الطول أقل من أو يساوي {maxLength}.

# equalLengthErrorText
source: Value must have a length equal to {length}.
ar: يجب أن يكون الطول مساويًا لـ {length}.

# minErrorText
source: Value must be greater than or equal to {min}.
ar: يجب أن تكون القيمة أكبر من أو تساوي {min}.

# maxErrorText
source: Value must be less than or equal to {max}.
ar: يجب أن تكون القيمة أقل من أو تساوي {max}.

# betweenErrorText
source: Value must be between {min} and {max}.
ar: يجب أن تكون القيمة بين {min} و {max}.

# matchErrorText
source: Value does not match pattern.
ar: القيمة لا تتطابق مع النمط.

# uppercaseErrorText
source: Value must be uppercase.
ar: يجب أن تكون القيمة بأحرف كبيرة.

# lowercaseErrorText
source: Value must be lowercase.
ar: يجب أن تكون القيمة بأحرف صغيرة.

# alphabeticalErrorText
source: Value must be alphabetical.
ar: يجب أن تكون القيمة أبجدية.

# containsErrorText
source: Value must contain {value}.
ar: يجب أن تحتوي القيمة على {value}.

# startsWithErrorText
source: Value must start with {value}.
ar: يجب أن تبدأ القيمة بـ {value}.

# endsWithErrorText
source: Value must end with {value}.
ar: يجب أن تنتهي القيمة بـ {value}.

# containsSpecialCharErrorText
source: Value must contain at least {min} special characters.
ar: يجب أن تحتوي القيمة على {min} أحرف خاصة على الأقل.

# containsUppercaseCharErrorText
source: Value must contain at least {min} uppercase characters.
ar: يجب أن تحتوي القيمة على {min} أحرف كبيرة على الأقل.

# containsLowercaseCharErrorText
source: Value must contain at least {min} lowercase characters.
ar: يجب أن تحتوي القيمة على {min} أحرف صغيرة على الأقل.

# containsNumberErrorText
source: Value must contain at least {min} numbers.
ar: يجب أن تحتوي القيمة على {min} أرقام على الأقل.

# mustBeTrueErrorText
source: This field must be true.
ar: يجب أن يكون هذا الحقل صحيحًا.

# mustBeFalseErrorText
source: This field must be false.
ar: يجب أن يكون هذا الحقل خاطئًا.

# ipErrorText
source: This field requires a valid IP.
ar: هذا الحقل يتطلب عنوان IP صالح.

# latitudeErrorText
source: Value must be a valid latitude.
ar: يجب أن تكون القيمة خط عرض صالح.

# longitudeErrorText
source: Value must be a valid longitude.
ar: يجب أن تكون القيمة خط طول صالح.

# base64ErrorText
source: Value must be a valid base64 string.
ar: يجب أن تكون القيمة نص base64 صالح.

# pathErrorText
source: Value must be a valid path.
ar: يجب أن تكون القيمة مسارًا صالحًا.

# oddNumberErrorText
source: Value must be an odd number.
ar: يجب أن تكون القيمة رقمًا فرديًا.

# evenNumberErrorText
source: Value must be an even number.
ar: يجب أن تكون القيمة رقمًا زوجيًا.

# positiveNumberErrorText
source: Value must be a positive number.
ar: يجب أن تكون القيمة رقمًا موجبًا.

# negativeNumberErrorText
source: Value must be a negative number.
ar: يجب أن تكون القيمة رقمًا سالبًا.

# notZeroNumberErrorText
source: Value must not be zero.
ar: يجب ألا تكون القيمة صفرًا.

# portNumberErrorText
source: Value must be a valid port number between {min} and {max}.
ar: يجب أن تكون القيمة رقم منفذ صالح بين {min} و {max}.

# macAddressErrorText
source: Value must be a valid MAC address.
ar: يجب أن تكون القيمة عنوان MAC صالح.

# uuidErrorText
source: Value must be a valid UUID.
ar: يجب أن تكون القيمة UUID صالح.

# jsonErrorText
source: Value must be valid JSON.
ar: يجب أن تكون القيمة JSON صالح.

# colorCodeErrorText
source: Value should be a valid {colorCode} color code.
ar: يجب أن تكون القيمة رمز لون {colorCode} صالح.

# singleLineErrorText
source: Value must be a single line.
ar: يجب أن تكون القيمة سطرًا واحدًا.

# timeErrorText
source: Value must be a valid time.
ar: يجب أن تكون القيمة وقتًا صالحًا.

# dateMustBeInTheFutureErrorText
source: Date must be in the future.
ar: يجب أن يكون التاريخ في المستقبل.

# dateMustBeInThePastErrorText
source: Date must be in the past.
ar: يجب أن يكون التاريخ في الماضي.

# dateRangeErrorText
source: Date must be in range {min} - {max}.
ar: يجب أن يكون التاريخ في النطاق {min} - {max}.

# fileExtensionErrorText
source: File extension must be {extensions}.
ar: يجب أن يكون امتداد الملف {extensions}.

# fileSizeErrorText
source: File size must be less than {maxSize} while it is {fileSize}.
ar: يجب أن يكون حجم الملف أقل من {maxSize} بينما هو {fileSize}.

# fileNameErrorText
source: Value must be a valid file name.
ar: يجب أن تكون القيمة اسم ملف صالح.

# creditCardCVCErrorText
source: This field requires a valid CVC code.
ar: هذا الحقل يتطلب رمز CVC صالح.

# creditCardExpirationDateErrorText
source: This field requires a valid expiration date.
ar: هذا الحقل يتطلب تاريخ انتهاء صالح.

# creditCardExpiredErrorText
source: This credit card has expired.
ar: انتهت صلاحية بطاقة الائتمان هذه.

# ibanErrorText
source: Value must be a valid IBAN.
ar: يجب أن تكون القيمة IBAN صالح.

# bicErrorText
source: Value must be a valid BIC.
ar: يجب أن تكون القيمة BIC صالح.

# ssnErrorText
source: Value must be a valid Social Security Number.
ar: يجب أن تكون القيمة رقم ضمان اجتماعي صالح.

# zipCodeErrorText
source: Value must be a valid ZIP code.
ar: يجب أن تكون القيمة رمز بريدي صالح.

# usernameErrorText
source: Value must be a valid username.
ar: يجب أن تكون القيمة اسم مستخدم صالح.

# passportNumberErrorText
source: Value must be a valid passport number.
ar: يجب أن تكون القيمة رقم جواز سفر صالح.

# cityErrorText
source: Value must be a valid city name.
ar: يجب أن تكون القيمة اسم مدينة صالح.

# countryErrorText
source: Value must be a valid country.
ar: يجب أن تكون القيمة بلدًا صالحًا.

# stateErrorText
source: Value must be a valid state.
ar: يجب أن تكون القيمة ولاية صالحة.

# streetErrorText
source: Value must be a valid street name.
ar: يجب أن تكون القيمة اسم شارع صالح.

# firstNameErrorText
source: Value must be a valid first name.
ar: يجب أن تكون القيمة اسمًا أول صالحًا.

# lastNameErrorText
source: Value must be a valid last name.
ar: يجب أن تكون القيمة اسمًا أخيرًا صالحًا.

# primeNumberErrorText
source: Value must be a prime number.
ar: يجب أن تكون القيمة رقمًا أوليًا.

# dunsErrorText
source: Value must be a valid DUNS number.
ar: يجب أن تكون القيمة رقم DUNS صالح.

# licensePlateErrorText
source: Value must be a valid license plate.
ar: يجب أن تكون القيمة لوحة ترخيص صالحة.

# vinErrorText
source: Value must be a valid VIN.
ar: يجب أن تكون القيمة VIN صالح.

# languageCodeErrorText
source: Value must be a valid language code.
ar: يجب أن تكون القيمة رمز لغة صالح.

# floatErrorText
source: Value must be a valid floating point number.
ar: يجب أن تكون القيمة رقم عشري صالح.

# hexadecimalErrorText
source: Value must be a valid hexadecimal number.
ar: يجب أن تكون القيمة رقمًا سداسي عشري صالح.

# isbnErrorText
source: Value must be a valid ISBN.
ar: يجب أن تكون القيمة ISBN صالح.

# timezoneErrorText
source: Value must be a valid timezone.
ar: يجب أن تكون القيمة منطقة زمنية صالحة.

# invalidMimeTypeErrorText
source: Invalid mime type.
ar: نوع MIME غير صالح.

# containsElementErrorText
source: Value must be in list.
ar: يجب أن تكون القيمة في القائمة.

# uniqueErrorText
source: Value must be unique.
ar: يجب أن تكون القيمة فريدة.

# minWordsCountErrorText
source: Value must have a words count greater than or equal to {minWordsCount}.
ar: يجب أن يكون عدد الكلمات أكبر من أو يساوي {minWordsCount}.

# maxWordsCountErrorText
source: Value must have a words count less than or equal to {maxWordsCount}.
ar: يجب أن يكون عدد الكلمات أقل من أو يساوي {maxWordsCount}.
